TopicResearch/Mycobacterium/_Resources.org
#+TITLE: Other Papers
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style> p{margin-bottom:5px;}</style>
#+HTML_HEAD: <style> li{margin-bottom:10px}</style

* TODO Advances in Computational Studies of Potential Drug Targets in Mycobacterium tuberculosis.
https://www.ncbi.nlm.nih.gov/pubmed/30084331
* TODO Hybrid design of isonicotinic acid hydrazide derivatives: machine learning studies, synthesis and biological evaluation of their anti-tuberculosis activity.
https://www.ncbi.nlm.nih.gov/pubmed/30973110
* TODO Machine learning and tubercular drug target recognition.
https://www.ncbi.nlm.nih.gov/pubmed/24245763





* WAIT Ahmed2020 - Non-tuberculous mycobacterial infections—A neglected and emerging problem
