TopicResearch/Mycobacterium/_Resources.md

<a id="org3af2075"></a>

## Notes

- Survey paper
- Could be used build up the background for the need for research in NTM

<a id="org40412d9"></a>

## FileName

- Ahmed2020<sub>NonTuberculosisMycoANeglectedAndEmergingProblem.pdf</sub>

<a id="org0bbd057"></a>

## Abstract

- The incidence of NTM infections is rising owing to a growing population of
  immunocompromised and vulnerable individuals, complex medical and surgical
  procedures, as well as increased awareness and diagnostic capabilities.

<a id="orgea30536"></a>

## FutureWork

- Simpler and more rapid tests would be ideal in making the diagnosis of NTM
  disease more quickly. However, the development of such tests is complicated
  by the large number of NTM species that can cause disease and by the criteria
  for disease, which require more than just the presence of the microorganism.
  As a result, NTM disease will require multiple diagnostic parameters, leading
  to delays and higher costs. More specific biomarkers to monitor the progress
  of treatment and test cure are lacking.

<a id="org3cabcbc"></a>

# STRT Aze2015 - Genomics and Machine Learning for Taxonomy Consensus: The Mycobacterium tuberculosis Complex Paradigm

<a id="org29168cf"></a>

## Notes

- Can adopt a similar approach towards the classification of NTB lineages
- Can alter the algorithm to XGBoost to Neural Networks to improve accuracy

<a id="org0a0102a"></a>

## FileName

- Aze2015<sub>GenomicsAndMachine.pdf</sub>

<a id="orgd4b5fa7"></a>

## Abstract

- Mycobacterium tuberculosis complex taxonomy has rapidly evolved in the last 20
  years through intensive clinical isolation, advances in sequencing and in the
  description of fast-evolving loci (CRISPR and MIRU-VNTR)

- The objectives of this study were 1) to explicit the consensus that exists
  between the alternative taxonomies, and 2) to provide an on-line tool to ease
  classification of new isolates. Genotyping (24-VNTR, 43-spacers spoli-
  gotypes, IS6110-RFLP) was undertaken for 3,454 clinical isolates from the
  Netherlands (2004-2008). The resulting database was enlarged with African
  isolates to include most human tuberculosis diversity. Assignations were
  obtained using TB-Lineage, MIRU- VNTRPlus, SITVITWEB and an algorithm from
  Borile et al

- Original and consensus assignations of the all isolates from the database were
  subsequently implemented into an ensemble learning approach based on Machine
  Learning tool Weka to derive a classification scheme.

- When applied to independent datasets, it was able to suggest new sublineages
  such as pseudo-Beijing. This Lineage Prediction tool, efficient on 15-MIRU,
  24-VNTR and spoligotype data is available on the web interface “TBminer.”

- We successfully used Machine Learning on a large dataset to set up and make
  available the first consensual taxonomy for human Mycobacterium tuberculosis
  complex

<a id="orge9822a8"></a>

## Conclusion

- We developed an approach making use of standard typing data for human M.

tuberculosis isolates to infer a consensual taxonomy concordant with most
up-to-date data on Whole Genome Sequencing diversity.

- We hope that the same approach can benefit other human pathogens having
  alternative taxonomies according to Serotypes, CRISPRtypes, MLST-types such as
  Salmo- nella, Listeria, Brucella, and more broadly to other organisms such as
  bacterial plant- pathogens.

<a id="orgcc48f60"></a>

# [-] Bagherian2019 - Machine learning approaches and databases for prediction of drug–target interaction: a survey paper

<a id="org19f4758"></a>

## Notes

- Not directly related to (N)TB
- Survey paper
- Analyzes various ML techniques
- Mentions various drug-target-interaction databases

<a id="org42711fd"></a>

## FileName

- Bagherian2019<sub>MachineLearning.pdf</sub>

<a id="org08f105d"></a>

## Abstract

- There is a need to develop novel and efficient prediction approaches in order
  to avoid costly and laborious yet not-always-deterministic experiments to
  determine drug–target interactions (DTIs) by experiments alone
- In this article, we describe the data required for the task of DTI prediction
  followed by a comprehensive catalog consisting of machine learning methods and
  databases, which have been proposed and utilized to predict DTIs
- The advantages and disadvantages of each set of methods are also briefly
  discussed

<a id="orgb610be2"></a>

## Conclusion

- Almost all the methods used in DTI prediction, particularly similarity-based
  methods, heavily rely on assertions concerning similar drugs and similar
  targets, the type of database used for the prediction plays a significant
  role.
- Future predictions should rely on more comprehensive inter- nal databases,
  which would require a significant effort to map and curate data across the
  sources that utilize different ways to define, name and identify the drugs and
  targets.

<a id="org99c7d50"></a>

# STRT Cao2016 - Improving Tuberculosis Diagnostics Using Deep Learning and Mobile Health Technologies among Resource-Poor and Marginalized Communities

<a id="org2bb03ea"></a>

## Notes

- Image processing algorithms, CNN
- They proposed an online database of X-ray images - by now this might have been developed

<a id="org0de4fef"></a>

## FileName

- Cao2016<sub>ImprovingDiagnosticsUsingDL.pdf</sub>

<a id="orgfc429aa"></a>

## Abstract

- The combination of machine learning and mobile computing techniques offers a
  unique opportunity to accelerate the TB diagnosis among these communities

- We first introduce major technique barriers and proposed system architecture

- The first activity aims to develop large-scale, real-world and well-annotated
  X-ray image database dedicated for automated TB screening.

- The second research activity focus on developing effective and efficient
  computational models (in particularly, deep convolutional neural networks
  (CNN)-based models) to classify the image into different category of TB
  manifestations

- Our future work includes: (1) to further improve the performance of the
  algorithms; and (2) to deploy our system in the city of Carabayllo in Perú, a
  densely occupied urban community and high-burden TB

<a id="orgb221989"></a>

## Conclusion

- The first progress is to build a large-scale, real-world, and well-annotated chest X- ray image
  database dedicated for TB screening.

- The second progress is to develop effective and efficient computational model for TB manifestation
  categorization.

- We will continue to develop the large scale, real-world X-ray TB database, as
  well as continuing to improve the performance of the computing algorithms

<a id="org5b59f6e"></a>

# STRT Chen2018 - Deep Learning Predicts Tuberculosis Drug Resistance Status from Whole-Genome Sequencing Data

<a id="org93782d0"></a>

## Notes

- A good in-depth ML based paper
- They&rsquo;ve shared high-level implementation details briefly
- Hyperparameters are also in the supplementary material
- I was able to find the code on Github
  <https://github.com/biosharp-dotnet/wdnn>
- Could apply the same techniques to NTM
- Could change the algorithm and apply on the same data
- The author built upon the previous paper by improving the accuracy of the ML model - we could do the same with NTM

<a id="org5583f25"></a>

## FileName

- Chen2018<sub>DeepLearningPredictsTuberculosis.pdf</sub>

<a id="org43d726a"></a>

## Abstract

- Using targeted or whole genome sequencing and conventional drug resistance
  phenotyping data from 3,601 Mycobacterium tuberculosis strains, 1,228 of which
  were multidrug resistant, we implemented the first multitask deep learning
  framework to predict phenotypic drug resistance to 10 anti-tubercular drugs

- The proposed wide and deep neural network (WDNN) achieved improved predictive
  performance compared to regularized logistic regression and random forest

<a id="org8ff37b6"></a>

## Conclusion

- We demonstrate that L2 regression and MD-WDNN trained on a larger diverse
  dataset using a method of aggregating rare variants outperforms our previously
  reported random forest model. (Chen, 2018)

- A few prior studies have utilized algorithmic or machine learning methods
  using genomic data to account for the complex relationship between genotype
  and drug resistance in MTB
