TopicResearch/Mycobacterium/_Resources.md

<a id="orgb788691"></a>

# STRT Chen2019 - Beyond multidrug resistance: Leveraging rare variants with machine and statistical learning models in Mycobacterium tuberculosis resistance prediction

<a id="orgcc2d08c"></a>

## Notes

- A good in-depth ML based paper
- Could apply the same techniques to NTM
- Could change the algorithm and apply on the same data

<a id="org4f50588"></a>

## FileName

- Chen2019<sub>BeyondMultiDrugResistance.pdf</sub>

<a id="org4626bae"></a>

## Abstract

- Whole genome sequencing of clinical Mycobacterium tuberculosis isolates
  promises to circumvent the long wait times and limited scope of conventional
  phenotypic antimicrobial susceptibility, but gaps remain for predicting
  phenotype accurately from genotypic data especially for certain drugs.

- We collected targeted or whole genome sequencing and conventional drug
  resistance phenotyping data from 3601 Mycobacterium tuberculosis strains
  enriched for resistance to first- and second-line drugs, with 1228 multidrug
  resistant strains

- We investigated the utility of (1) rare variants and variants known to be
  determinants of resistance for at least one drug and (2) machine and
  statistical learning architectures in predicting phenotypic drug resistance to
  10 anti-tuberculosis drugs

<a id="org5636ab1"></a>

## Conclusion

- Our approach allowed us to gain new insights into the relative im- portance of
  specific genetic variants for resistance prediction

- In summary, we present an exploration of machine learning and traditional
  statistical models to identify the resistance of MTB isolates to 10
  anti-tuberculosis drugs from whole genome sequencing data.

- Our models trained on rare and common genetic variants achieved
  state-of-the-art performance on a large, aggregated TB dataset, with
  prediction times of less than a tenth of a second, demonstrating the efficacy
  of our model as a diagnostic tool for MTB drug resistance.

- The MD-WDNN represented the first multidrug model to our knowledge that

incorporated a high number of genotypic predictors known to be important to
determining resistance for one or more included drugs

<a id="org67edce3"></a>

# [-] Ching2018 - Opportunities and obstacles for deep learning in biology and medicine

<a id="orgb1f040d"></a>

## Notes

- Found the code <https://github.com/greenelab/deep-review>
- Can use this paper to build up the background for using DL in MTB and NTM analysis

<a id="org1317902"></a>

## FileName

- Ching2018<sub>OpportunitiesAndObstaclesForDLInBiology.pdf</sub>

<a id="org0a6ad34"></a>

## Abstract

- Following from an extensive literature review, we find that deep learning has
  yet to revolutionize biomedicine or definitively resolve any of the most
  pressing challenges in the field, but promising advances have been made on the
  prior state of the art
- The limited amount of labelled data for training presents problems in some
  domains, as do legal and privacy constraints on work with sensitive health
  records.

<a id="org7683ee6"></a>

## Conclusion

- The most challenging tasks may be those in which predictions are used directly
  for downstream model- ling or decision-making, especially in the clinic. As an
  example, errors in sequence variant calling will be amplified if they are used
  directly for genome-wide association studies.

- In addition, the stochasticity and complexity of biological sys- tems imply
  that for some problems, for instance, predicting gene regulation in disease,
  perfect accuracy will be unattainable

<a id="org2166fc7"></a>

# STRT Deelder2019 - Machine Learning Predicts Accurately Mycobacterium tuberculosis Drug Resistance From Whole Genome Sequencing Data

<a id="orgb1b0a45"></a>

## Notes

- Need to request code from authors
- Good ML oriented paper

<a id="org9f02c86"></a>

## FileName

- Deelder2019<sub>MLPredictsAccurately.pdf</sub>

<a id="org06f5679"></a>

## Abstract

- We applied machine learning approaches to 16,688 M. tuberculosis isolates that
  have undergone WGS and laboratory drug-susceptibility testing (DST) across 14
  antituberculosis drugs, with 22.5% of samples being multidrug resistant and
  2.1% being extensively drug resistant.

- We fitted separate models for each drug, with and without “co-occurrent
  resistance” markers known to be causing resistance to drugs other than the one
  of interest. Predictive performance was measured using sensitivity,
  specificity, and the area under the receiver operating characteristic curve,
  assuming DST results as the gold standard.

- Overall, the gradient-boosted-tree models performed better than the
  classification-tree models.

- Our work demonstrates the utility of machine learning as a flexible approach
  to drug resistance prediction that is able to accommodate a much larger number
  of predictors and to summarize their predictive ability, thus assisting
  clinical decision making and single nucleotide polymorphism detection in an
  era of increasing WGS data generation.

<a id="orga1a1679"></a>

## Conclusion

- The predictive performance was highest for resistance to first-line drugs,
  and multidrug-resistant tuberculosis (area under the receiver operating characteristic curve above
  96%), and lowest for third- line drugs (area under the curve below 85%).

<a id="org079f508"></a>

## Supplementary

<a id="orgb12e761"></a>

### Deelder2019<sub>MLPredictsAccurately</sub><sub>Data</sub><sub>Sheet</sub><sub>1.pdf</sub>

<a id="org458ec36"></a>

# [?] Djout2016 - Predictive modeling targets thymidylate synthase ThyX in Mycobacterium tuberculosis

<a id="org99f1375"></a>

## Notes

- This requires more knowledge of chemistry and perhaps also relies on lab based experiments

<a id="org8605625"></a>

## FileName

- Djout2016<sub>PredictiveModeling.pdf</sub>

<a id="org32a32ef"></a>

## Abstract

- ThyX is an essential thymidylate synthase

that is mechanistically and structurally unrelated to the human enzyme. DNA
gyrase is a DNA topoisomerase present in bacteria and plants but not animals.
The current study set out to understand the structure-activity relationships of
these targets in Mtb using a combination of cheminformatics and in vitro
screening.

<a id="org38d5d70"></a>

## Conclusion

<a id="orgc9f7a4d"></a>

# STRT Donohue2018 - Increasing nontuberculous mycobacteria reporting rates and species diversity identified in clinical laboratory reports

<a id="orgea645b2"></a>

## Notes

- This is a survey report about NTM across a couple decades
- Could be used in building up the background context

<a id="org96912b3"></a>

## FileName

- Donohue2018<sub>IncreasingNTMReportingRates.pdf</sub>

<a id="org6e12d69"></a>

## Abstract

- Changes in NTM diversity were observed in complex/groups known to be
  clinically significant. Between 1994 and 2014 the rate implicating M.
  abscesses-chelonae group and M. avium complex increased by 322 and 149%,
  respectively.

<a id="orgf5abeb8"></a>

## Conclusion

- Knowledge of the NTM species most frequently associ- ated with adverse human
  health consequences will assist epidemiological investigators to identify
  likely sources and modes of exposure associated with these types of in-
  fections.
- As the U.S. population ages, the public health burden from NTM associated
  disorders is expected to increase.

<a id="orgae365bb"></a>

# [-] Doshi2017 - Tuberculosis control, and the where and why of artificial intelligence

<a id="orgb6f1e8f"></a>

## Notes

- Survey paper
- Can be used for building background context

<a id="org84190c4"></a>

## FileName

- Doshi2017<sub>TuberculosisControl.pdf</sub>

<a id="orgd40ebae"></a>

## Abstract

<a id="org02569fd"></a>

## Conclusion

<a id="org9235f30"></a>

# [X] Ekins2013 - Enhancing Hit Identification in Mycobacterium tuberculosis Drug Discovery Using Validated Dual-Event Bayesian Models
