TopicResearch/Mycobacterium/_Resources.org
** Abstract
- High-throughput screening (HTS) in whole cells is widely pursued to find
  compounds active against Mycobacterium tuberculosis (Mtb) for further
  development towards new tuberculosis (TB) drugs
- We have recently built and validated Bayesian machine learning models for
  predicting compounds with activity against Mtb based on publicly available
  large-scale HTS data from the Tuberculosis Antimicrobial Acquisition
  Coordinating Facility
** Conclusion
* [X] Ekins2013 - Fusing Dual-Event Data Sets for Mycobacterium tuberculosis Machine Learning Models and Their Evaluation
** Notes
- Requires too much domain knowledge
- Perhaps uses an older technique i.e. HTS for analysis
- Could use other algorithms on the data used in this study
** FileName
- Ekins2013_FusingDualEvent.pdf
** Abstract
- A cheminformatics data-fusion
approach followed by Bayesian machine learning, Support Vector Machine, or Recursive
Partitioning model development (based on publicly available Mtb screening data) was used to
compare individual data sets and subsequent combined models.
- We demonstrate that
combining three data sets incorporating antitubercular and cytotoxicity data in Vero cells
from our previous screens results in external validation receiver operator curve (ROC) of
0.83 (Bayesian or RP Forest)
** Conclusion
* [X] Ekins2014_AreBiggerDataSets.pdf
** Notes
- Requires too much domain knowledge
- Perhaps uses an older technique i.e. HTS for analysis
- Could use other algorithms on the data used in this study
** Title
** Abstract
** Conclusion
* [X] Ekins2014_CombiningComputationalMethods.pdf
** Notes
- Requires too much domain knowledge
- Perhaps uses an older technique i.e. HTS for analysis
- Could use other algorithms on the data used in this study
** Title
** Abstract
** Conclusion
* [X] Ekins2016_MachineLearningModel.pdf
** Notes
- Requires too much domain knowledge
- Perhaps uses an older technique i.e. HTS for analysis
- Could use other algorithms on the data used in this study
** Title
** Abstract
** Conclusion
* [X] Ekins2017_MachineLearning.pdf
** Notes
- Requires too much domain knowledge
- Perhaps uses an older technique i.e. HTS for analysis
- Could use other algorithms on the data used in this study
** Title
** Abstract
** Conclusion
* [-] Engle2019 - Performance of Qure.ai automatic classifiers against a large annotated database of patients with diverse forms of tuberculosis
** Notes
- Image processing
- Mentiones the database source, NIH
- Has CSV as supplementary data
** FileName
- Engle2019_PerformanceOfQureAI.pdf
** Abstract
- Availability of trained radiologists for fast processing of CXRs in regions
  burdened with tuberculosis always has been a challenge, affecting both timely
  diagnosis and patient monitoring.
 
- The Qure.ai qXR arti- ficial intelligence automated CXR interpretation tool,
  was blind-tested on the 346 radiologist- annotated CXRs from the TBPP
  database.

- We conclude that applying fully automated Qure.ai CXR analysis tool is useful
  for fast, accurate, uniform, large-scale CXR annotation assistance, as it
  performed well even for DR-TB cases that were not used for initial training.
 
** Conclusion
- We demonstrated that the Qure.ai qXR CXR annotations for cavity, nodule,
  pleural effusion, and hilar lymphadenopathy, are in statistical agreement with
  radiologist CXR annotations.
 
- A corresponding analysis of patient case matched
  CT image annotations recorded within 30 days of a CXR supports this result,
  demonstrating statistical significance for cavity, pleural effusion, hilar
  lymphadenopathy, and atelectasis.
 
* [-] Greif2020 - Species Distribution and Isolation Frequency of Nontuberculous Mycobacteria, Uruguay
** Notes
- Survey paper
** FileName
- Greif2020_FrequencyOfNTM.pdf
** Abstract
-  Nontuberculous mycobacteria (NTM) increasingly are recognized as
  opportunistic pathogens of humans.
-  NTM species distribution is well documented in Europe and North America
** Conclusion
- Our findings indicate that rate of NTM have risen nearly 5-fold (4.79) in
  Uruguay, from 0.33 cas- es/100,000 inhabitants in 2006 to 1.57 cases/100,000
  inhabitants in 2018.
 
* [-] Hicks2019 - Evaluation of parameters affecting performance and reliability of machine learning-based antibiotic susceptibility testing from whole genome sequencing data
** Notes
- Can perform the mentioned analysis on the MTB and NTM data
- The paper focuses on the factors affecting the application and clinical application of ML models
** FileName
- Hicks2019_EvaluationOfParameters.pdf
** Abstract
- There has been no systematic evaluation of factors that may influence
  performance of ML models, how they might apply to and vary across clinical
  populations, and what the implications might be in the clinical setting
 
- We performed a meta-analysis of seven large Neisseria gonorrhoeae datasets, as
  well as Klebsiella pneumoniae and Acinetobacter baumannii datasets, with whole
  genome sequence data and antibiotic susceptibility phenotypes using set
  covering machine classifi- cation, random forest classification, and random
  forest regression models to predict resis- tance phenotypes from genotype.
 
- We demonstrate how model performance varies by drug, dataset, resistance
  metric, and species, reflecting the complexities of generating clinically
  relevant conclusions from machine learning-derived models.

- Our results highlight significant biological and technical challenges
  facing the application of machine learning-based prediction of antibiotic
  resistance as a diagnostic tool.

** Conclusion
* STRT Hussain2018 - Predicting treatment outcome of drug-susceptible tuberculosis patients using machine-learning models
** Notes
- Can use a different algorithm (XgBoost) on the dataset
- Sample data and complete code is shared
  https://github.com/biosharp-dotnet/tuberculosis-predictive-analytics
- Need to find the full dataset of 4000 surveyed patients
** FileName
- Hussain2018_PredictingTreatmentOutcomes.pdf
** Abstract
- Tuberculosis (TB) is a deadly contagious disease and a serious global health
  problem. It is curable but due to its lengthy treatment process, a patient is
  likely to leave the treatment incomplete, leading to a more lethal, drug
  resistant form of disease.
 
- We aim to facilitate TB programs by predicting the outcome of the treatment of
  a particular patient at the start of treatment so that their health workers
  can be utilized in a targeted and cost-effective way.

- The problem was modeled as a classification problem, and the outcome of
  treatment was predicted using state-of-art implementations of 3 machine learning algorithms
 
** Conclusion
- Empirical results using data of more than 4000 patients reveal that we can
  predict with more than 76% accuracy whether a TB patient would complete his (or her) treatment or not
-
* STRT Jamal2020 - Artificial Intelligence and Machine learning based prediction of resistant and susceptible mutations in Mycobacterium tuberculosis
