TopicResearch/Mycobacterium/_Resources.md

<a id="org4bf4c0b"></a>

## Notes

- Used many ML algorithms, 85% accuracy
- Could use XgBoost
- Could conduct a similar study for NTM
- Mentions many online bio databases

<a id="orgbc5fbfc"></a>

## FileName

- Jamal2020<sub>AIAndMLBasedPredictive.pdf</sub>

<a id="org231f0a8"></a>

## Abstract

- The present work is a computational framework that uses artificial
  intelligence (AI) based machine learning (ML) approaches for predicting
  resistance in the genes rpoB, inhA, katG, pncA, gyrA and gyrB for the drugs
  rifampicin, isoniazid, pyrazinamide and fluoroquinolones

- The single nucleotide variations were represented by several sequence and
  structural features that indicate the influence of mutations on the target
  protein coded by each gene.

<a id="org2115d6d"></a>

## Conclusion

- The present study proposes an AI/ML method to classify resistant and susceptible
  mutations in TB and predict novel resistance conferring mutations.

- The impact of the reported mutations was captured in the form of changes in the amino acid
  residues, and the consequent change in properties vis-a-vis wild-type and mutant
  proteins and represented as features used to train the models.

- The classification model was generated for each gene and predictions were made for
  SNVs linked with each gene for each drug

<a id="org4561305"></a>

# STRT Kavvas2018 - Machine learning and structural analysis of Mycobacterium tuberculosis pan-genome identifies genetic signatures of antibiotic resistance

<a id="org06d59b6"></a>

## Notes

- They developed and online platform

- Can be applied to NTM

- Code is available
  <https://github.com/biosharp-dotnet/microbial_AMR_ML>

<a id="orgc1a4e40"></a>

## FileName

- Kavvas2018<sub>MachineLearning</sub><sub>.pdf</sub>

<a id="orgfacbd67"></a>

## Abstract

- The many publicly available datasets describing its AMR characteristics demand
  disparate data-type analyses.

- Here, we develop a reference strain-agnostic computational platform that uses
  machine learning approaches, complemented by both genetic interaction analysis
  and 3D structural mutation-mapping, to identify signatures of AMR evolution to
  13 antibiotics.

- First, a pan-genome analysis shows that M. tuberculosis is highly conserved
  with sequenced variation concentrated in PE/PPE/PGRS genes.

- Second, the platform corroborates 33 genes known to confer resistance and identifies 24
  new genetic signatures of AMR.

- Third, 97 epistatic interactions across 10 resistance classes are revealed.

- Fourth, detailed structural analysis of these
  genes yields mechanistic bases for their selection.

- The platform can be used to study other human pathogens

<a id="orgbff455b"></a>

## Conclusion

- The platform was applied to 1595 sequenced strains to yield results in four
  categories: pan-genome properties, identification of genes conferring
  antibiotic resistance, their epistatic interactions, and protein structure
  based mechanistic insights.

<a id="org31db702"></a>

# [-] Khanna2018 - Ensemble Technique for Prediction of T-cell Mycobacterium tuberculosis Epitopes

<a id="org13d8ba6"></a>

## Notes

- Uses multiple bio and ML packages in R
- Doesn&rsquo;t use XgBoost or H20
- Code hasn&rsquo;t been shared

<a id="org4bbe619"></a>

## FileName

- Khanna2018<sub>EnsembleTechnique.pdf</sub>

<a id="org52247f3"></a>

## Abstract

- Development of an effective machine-learning model for T-cell Mycobacterium
  tuberculosis (M. tuberculosis) epitopes is beneficial for saving biologist’s
  time and effort for identifying epitope in a targeted antigen.

- The proposed method is able to work with variable length epitopes having size
  even greater than 9-mers. Identification of T-cell or B-cell epitopes in the
  targeted antigen is the main goal in designing epitope-based vaccine,
  immune-diagnostic tests and antibody production

- The proposed ensemble model achieves 82.0% accuracy, 0.89 specificity, 0.77
  sensitivity with repeated k-fold cross-validation having average accuracy of
  80.61%.

<a id="orgb164426"></a>

## Conclusion

- Three models (decision tree, avNNet and RRF) have been used to design the
  ensemble model which produces high accuracy, Gini, AUC, specificity and
  sensitivity.

- To validate and compare the proposed ensemble model, NetMHC 4.0, NetMHC 2.3
  and CTLpred servers have been considered.

<a id="org4eb7f15"></a>

# [-] Killian2019 - Learning to Prescribe Interventions for Tuberculosis Patients Using Digital Adherence Data

<a id="org1da2420"></a>

## Notes

- Wasn&rsquo;t able to find the data or the code in the paper

<a id="orgc89a3a6"></a>

## FileName

- Killian2019<sub>LearningToPrescribe.pdf</sub>

<a id="org64567a7"></a>

## Abstract

- We analyze data from one city served by 99DOTS, a phone-call- based DAT
  deployed for Tuberculosis (TB) treatment in India where nearly 3 million
  people are afflicted with the disease each year

- We then construct a deep learning model, demonstrate its interpretability, and
  show how it can be adapted and trained in three different clinical scenarios
  to better target and improve patient care.

<a id="org8e9092e"></a>

## Conclusion

- We finally show that tailoring our model for a specific intervention via
  decision-focused learning can improve performance by a further 15%.

<a id="orgb76b872"></a>

# WAIT Kouchaki2019 - Application of machine learning techniques to tuberculosis drug resistance analysis

<a id="org6311634"></a>

## Notes

- I&rsquo;ve asked the author to provide the source code via ResearchGate
- They&rsquo;ve used 6 ML classifiers, not XgBoost or NeuralNetworks

<a id="org0c00ba1"></a>

## FileName

- Kouchaki2019<sub>ApplicationOfML.pdf</sub>

<a id="org731afd1"></a>

## Abstract

- Machine learning methods have been widely applied for timely predicting
  resistance of MTB given a specific drug and identifying resistance markers.
  However, they have been not validated on a large cohort of MTB samples from
  multi-centers across the world in terms of resistance prediction and
  resistance marker identification

- Several machine learning classifiers and linear dimension re- duction
  techniques were developed and compared for a cohort of 13 402 isolates
  collected from 16 countries across 6 continents and tested 11 drugs.

<a id="orgfc43954"></a>

## Conclusion

- Developing machine learning techniques is especially important to im- prove TB
  resistance prediction, mainly sensitivity for less-studied drugs.
-

<a id="orgce81f81"></a>

## Supplementary

<a id="org08bf183"></a>

### Kouchaki2019<sub>ApplicationOfML</sub><sub>Supplementary.pdf</sub>

<a id="org350bc02"></a>

# STRT Kouchaki2020 - Multi-Label Random Forest Model for Tuberculosis Drug Resistance Classification and Mutation Ranking

<a id="org73d98b4"></a>

## Notes

- Source code and data are both available

<a id="org07a1565"></a>

## FileName

- Kouchaki2020<sub>MultiLabelRandomForest.pdf</sub>

<a id="org2399359"></a>

## Abstract

- Due to standard regimens for the use of first-line antibiotics, resistance
  co-occurrence, in which samples are resistant to multiple drugs, is common.
  Analysing all drugs simultaneously should therefore enable patterns reflecting
  resistance co-occurrence to be exploited for resistance prediction

- Here, multi-label random forest (MLRF) models are compared with single-label
  random forest (SLRF) for both predicting phenotypic resistance from whole
  genome sequences and identifying important mutations for better prediction of
  four first-line drugs in a dataset of 13402 Mycobacterium tuberculosis
  isolates.

<a id="org61ce5d8"></a>

## Conclusion

<a id="orgf193555"></a>

## Supplementary

<a id="orge82f727"></a>

### Kouchaki2020<sub>MultiLabel.zip</sub>

<a id="orga199105"></a>

### Kouchaki2020<sub>MultiLabel</sub><sub>DataSheet</sub><sub>1.pdf</sub>

<a id="orgb3e5224"></a>

### Kouchaki2020<sub>MultiLabel</sub><sub>DataSheet</sub><sub>2.pdf</sub>

<a id="orgb8f235a"></a>

# [-] Kovalishyn2019 - Hybrid Design of Isonicotinic Acid Hydrazide Derivatives: Machine Learning Studies, Synthesis and Biological Evaluation of their Anti- tuberculosis Activity

<a id="org7d40156"></a>

## Notes

- Is inclined more towards Chemistry (reagents) wrt TB
