TopicResearch/Mycobacterium/_Resources.md

<a id="orgfc72e57"></a>

## FileName

- Kovalishyn2019<sub>HybridDesign.pdf</sub>

<a id="org12c1664"></a>

## Abstract

- The goal of this work is to identify potent small molecule anti-TB agents by
  machine learning, synthesis and biological evaluation.

- The On-line Chemical Database and Modeling Environment (OCHEM) was used to
  build pre- dictive machine learning models. Seven compounds were synthesized
  and tested in vitro for their an- titubercular activity against H37Rv and
  resistant Mtb strains.

-

<a id="orga4eb91e"></a>

## Conclusion

- The goal of this work was to investigate isoniazid- thiazole hybrid compounds
  taking into consideration the key structural futures known to be important for
  their antituber- cular activity.

- The created binary classification models demonstrated good balanced accuracy.
  The predictive power of the binary classifiers was tested by a 5-fold cross-
  validation and resulted in balanced accuracies of 61–78 %. Seven new compounds
  were synthesized and their activity against Mtb H37Rv and MDR strains was
  evaluated at two concentrations (1.5 and 50 μМ) using rifampin and isoniazid
  as controls.

<a id="orgbce092c"></a>

# [-] Kumari2019 - A genetic programming-based approach to identify potential inhibitors of serine protease of Mycobacterium tuberculosis

<a id="org571efc8"></a>

## Notes

- Uses Genetic algorithms and ML algorithms as well
- Data or code isn&rsquo;t available

<a id="orgaa7dc2f"></a>

## FileName

- Kumari2019<sub>AGeneticProgramming.pdf</sub>

<a id="org0b1fb1c"></a>

## Abstract

- We applied genetic programming approaches to understand the impact of
  descriptors on inhibitory effects of serine protease inhibitors of
  Mycobacterium tuberculosis (Mtb) and the discovery of new in- hibitors as drug
  candidates

- The experimental dataset of serine protease inhibitors of Mtb descriptors was
  optimized by genetic algorithm (GA) along with the correlation-based feature
  selection (CFS) in order to develop predictive models using machine-learning
  algorithms.

- The use of CFS-GA with random forest-enhanced classification accuracy and
  predicted new serine protease inhibitors of Mtb, which can be used for better
  drug development against tuberculosis.

<a id="org84c254f"></a>

## Conclusion

- Comparative analysis of statistical measures for four different
  machine-learning algorithms revealed that RF models with CFS-GA performed
  better than the others.

- The best RF models with CFS-GA predicted new serine protease inhibitors of
  Mtb, which can be used for better drug development against tuberculosis

<a id="org151e742"></a>

# [-] Lai2019 - Comparison of the Predictive Outcomes for Anti-Tuberculosis Drug-Induced Hepatotoxicity by Different Machine Learning Techniques

<a id="orgc1fa3b5"></a>

## Notes

- Good ML oriented paper
- Can&rsquo;t find the data or code

<a id="org8c2c872"></a>

## FileName

- Lai2019<sub>ComparisonOfThePredictiveOutcomes.pdf</sub>

<a id="org80d7806"></a>

## Abstract

- The study compared the performance of artificial neural network, support
  vector machine and random forest on predicting anti-tuberculosis drugs induced
  hepatotoxicity.

- Combining genomic and clinical data can further increase the area under
  receiver operating characteristic curve than using genomic or clinical data
  alone.

- Nine models were created with 7 clinical factors and 4 genotypes

<a id="org0c2d590"></a>

## Conclusion

<a id="org381822d"></a>

# [-] Lane2018 - Comparing and Validating Machine Learning Models for Mycobacterium tuberculosis Drug Discovery

<a id="org83d9892"></a>

## Notes

- Involves chemistry

<a id="orgb21f75d"></a>

## FileName

- Lane2018<sub>ComparingAndValidating.pdf</sub>

<a id="org51b0191"></a>

## Abstract

- The need to develop new treatments for those infected with Mycobacterium
  tuberculosis (Mtb) has led to many large-scale phenotypic screens and many
  thousands of new active compounds identified in vitro

- We have curated small molecule Mtb data and developed new models with a total
  of 18,886 molecules with activity cutoffs of 10 μM, 1 μM, and 100 nM. These
  data sets were used to evaluate different machine learning methods (including
  deep learning) and metrics and to generate predictions for additional
  molecules published in 2017

- We have also compared these models with additional machine learning algorithms
  showing Bayesian machine learning models con- structed with literature Mtb
  data generated by different laboratories generally were equivalent to or
  outperformed deep neural networks with external test sets.

<a id="org8a5fce9"></a>

## Conclusion

<a id="orgcbaa13d"></a>

# [X] Lin2001 - Conserved codon composition of ribosomal protein coding genes in Escherichia coli, Mycobacterium tuberculosis and Saccharomyces cerevisiae: lessons from supervised machine learning in functional genomics

<a id="org374297e"></a>

## Notes

- Deals with codons and homologs etc. No idea.

<a id="orga80e21d"></a>

## FileName

- Lin2001<sub>ConservedCodonComposition.pdf</sub>

<a id="org683b57b"></a>

## Abstract

<a id="org3a1845a"></a>

## Conclusion

<a id="orgfe08a7f"></a>

# [?] LokeshKumar2019 - Prediction of Multi Drug Resistant Tuberculosis using Machine Learning Techniques

<a id="org0064cb6"></a>

## Notes

- Survey paper
- Offers quick overview of various algorithms with accuracy and other characteristics

<a id="org4eec524"></a>

## FileName

- LokeshKumar2019<sub>PredictionOfMultiDrugResistant.pdf</sub>

<a id="org29d3779"></a>

## Abstract

- We review different Machine Learning Approaches to predict MDR-TB. Different
  feature estimation methods, execution of distinct machine learning models also
  have been explored.
- AdaBoost ensemble algorithm gave the highest accuracy of all

<a id="org6a267da"></a>

## Conclusion

<a id="org39d7d66"></a>

# [X] Mahe2019 - A large scale evaluation of TBProfiler and Mykrobe for antibiotic resistance prediction in Mycobacterium tuberculosis

<a id="orgc2b1c06"></a>

## Notes

- Doesn&rsquo;t directly relate to the dissertation

<a id="orge7b670d"></a>

## FileName

- Mahe2019<sub>ALargeScaleEvaluationTBProfiler.pdf</sub>

<a id="orge778dfd"></a>

## Abstract

<a id="org53444b8"></a>

## Conclusion

<a id="org6d6e189"></a>

# [-] Marino2016 - Computational and Empirical Studies Predict Mycobacterium tuberculosis-Specific T Cells as a Biomarker for Infection Outcome

<a id="orgdfa4f2f"></a>

## Notes

- They conducted their own experiments

<a id="org302ae1f"></a>

## FileName

- Marino2016<sub>ComputationalAndEmpirical.pdf</sub>

<a id="orgf4233b6"></a>

## Abstract

- Identifying biomarkers for tuberculosis (TB) is an ongoing challenge in
  developing immuno- logical correlates of infection outcome and protection.

- To effectively predict biomarkers for infection progression in any disease,
  including TB, large amounts of experi- mental data are required to reach
  statistical power and make accurate predictions.

- Machine learning techniques were used to interrogate the experimental NHP
  datasets without identifying any potential TB biomarker. In parallel, we used
  our extensive novel NHP datasets to build and calibrate a multi-organ
  computational model that combines what is occurring at the site of infection
  (e.g., lung) at a single granuloma scale with blood level readouts that can be
  tracked in mon- keys and humans.

<a id="org64737cd"></a>

## Conclusion

<a id="org8049ffa"></a>

# [-] Marques2019 - Pulmonary nontuberculous mycobacterial infections: presumptive diagnosis based on the international microbiological criteria adopted in the state of São Paulo, Brazil, 2011-2014

<a id="org3c352c1"></a>

## Notes

- Survey paper for NTM
- Can be used for building up the background

<a id="org7729758"></a>

## FileName

- Marques2019<sub>PulmonaryNTMInfections.pdf</sub>

<a id="org618e04f"></a>

## Abstract

- The objective of the present study was to determine the frequency at which the
  various NTM species are identified among selected individuals and in potential
  cases of pulmonary nontuberculous mycobacterial infection.

<a id="org206108f"></a>

## Conclusion

- Although various NTM species were identified among the individuals studied,
  those presumptively identified most frequently on the basis of the
  microbiological criteria adopted in the state of São Paulo were the ones that
  are most commonly associated with pulmonary nontuberculous mycobacterial
  infection worldwide or in specific geographic regions.
