TopicResearch/Mycobacterium/_Resources.md

<a id="org1653bf3"></a>

# [-] Meldenez2015 - On Combining Multiple-Instance Learning and Active Learning for Computer-Aided Detection of Tuberculosis

<a id="org0b7cde2"></a>

## Notes

- Image processing, radiography

<a id="org32e9cdd"></a>

## FileName

- Meldenez2015<sub>OnCombiningMultiple.pdf</sub>

<a id="org72d2f54"></a>

## Abstract

- The major advantage of multiple-instance learning (MIL) applied to a
  computer-aided detection (CAD) system is that it allows optimizing the latter
  with case-level labels instead of accurate lesion outlines as traditionally
  required for a supervised approach.

- As shown in previous work, a MIL-based CAD system can perform comparably to
  its supervised counterpart considering complex tasks such as chest radiograph
  scoring in tuberculosis (TB) detection. However, despite this remarkable
  achievement, the uncertainty inherent to MIL can lead to a less satisfactory
  outcome if analysis at lower levels (e.g., regions or pixels) is needed.

- To minimize the labeling effort, we develop a novel instance selection
  mechanism that exploits the MIL problem definition through one-class
  classification.

<a id="org2231265"></a>

## Conclusion

<a id="orge7803ce"></a>

# [-] Mikusova2016 - Learning from the past for TB drug discovery in the future

<a id="org7f237e1"></a>

## Notes

- Involves chemistry
- Survey paper
- Can be used to build up the context for Drug-Target-Interaction

<a id="orgc5d37f8"></a>

## FileName

- Mikusova2016<sub>LearningFromThePast.pdf</sub>

<a id="org0080b4f"></a>

## Abstract

- Tuberculosis drug discovery has shifted in recent years from a primarily
  target-based approach to one that uses phenotypic high-throughput screens.

- It is clear that we still have much to learn about the drug targets and the
  complex effects of the drugs on Mycobacterium tuberculosis.

- We propose a more integrated approach that learns from earlier drug discovery
  efforts that could help to move drug discovery forward.

<a id="org529de8a"></a>

## Conclusion

<a id="org0c488b6"></a>

# [-] Ngo2019 - Genomic prediction of tuberculosis drug- resistance: benchmarking existing databases and prediction algorithms

<a id="org95c9a78"></a>

## Notes

- This paper seems important but I&rsquo;m unable to see how to use this in the dissertation.

<a id="org7d5bbf2"></a>

## FileName

- Ngo2019<sub>GenomicPrediction.pdf</sub>

<a id="org09f64ef"></a>

## Abstract

- It is possible to predict whether a tuberculosis (TB) patient will fail to
  respond to specific antibiotics by sequencing the genome of the infecting
  Mycobacterium tuberculosis (Mtb) and observing whether the pathogen carries
  specific mutations at drug-resistance sites.

- Here, we evaluate the performance of four popular tools (TBProfiler, MyKrobe,
  KvarQ, PhyResSE) with 6746 isolates compiled from publicly available
  databases, and subsequently identify highly probable phenotyping errors in the
  databases by genetically predicting the drug phenotypes using all four
  software.

- Our results show that these bioinformatics tools generally perform well in
  predicting the resistance status for two key first-line agents (isoniazid,
  rifampicin), but the accuracy is lower for second-line injectables and
  fluoroquinolones.

<a id="org314fb32"></a>

## Conclusion

- The use of whole-genome sequencing to replace conventional laboratory-based
  drug-susceptibility testing reduces the time taken to culture and test against
  individual drugs, but requires sophisticated bioinformatics algorithms to be
  designed and validated to translate the genetic information into drug
  susceptibility phenotypes.

- Using latent class modeling, we have identi- fied which isolates in the
  existing databases are likely to present erroneous DST phenotypes and
  recalibrated the performance of these bioinformatics software adjusting for
  errors in the existing databases.

- However, we still observe low sensitivity in detecting resistance to ETO,
  PAS, PTO, and PZA.

- Without a clear understanding to the genetic biomarkers of drug resistance or
  to their pene- trance, or at least more powerful algorithms that can pick up
  additional intricacies of resistance across multiple drugs, such as what have
  been done for HIV and cancer [22–24], the ability to successfully predict the
  presence of drug-resistance is reduced.

<a id="orge4f19d6"></a>

# [-] Periwal2011 - Predictive models for anti-tubercular molecules using machine learning on high-throughput biological screening datasets

<a id="org2129bd0"></a>

## Notes

- Could build upon this paper by using XgBoost and other classification
  algorithms
- They&rsquo;ve used Weka
- Data is available
- Code is not available
- They&rsquo;ve also relied on some closed-source software

<a id="orgb5f9640"></a>

## FileName

- Periwal2011<sub>PredictiveModels.pdf</sub>

<a id="org5d0eae6"></a>

## Abstract

- Recent reports suggest that Mtb has been developing resistance to the widely
  used anti-tubercular drugs resulting in the emergence and spread of multi
  drug-resistant (MDR) and extensively drug-resistant (XDR) strains throughout
  the world.

- Whole organism screens on the other hand are target-agnostic and have been now
  widely employed as an alternative for lead identification but they are limited
  by the time and cost involved in running the screens for large compound
  libraries.

<a id="org7e10bcc"></a>

## Conclusion

- We have employed a systematic and comprehensive approach to build supervised
  classification based predictive models for anti-tubercular agents from
  publicly available bioassay datasets for in-vitro screens for Mtb inhibitors.

- We have generated classification models for anti-tubercular agents with four
  commonly used state-of-the-art classifiers i.e. Naïve Bayes, Random Forest,
  J48 and SMO

<a id="orgb645b0a"></a>

# [ ] Ratnatunga2020 - The Rise of Non-Tuberculosis Mycobacterial Lung Disease

<a id="org9726f1b"></a>

## Notes

- Survey paper for NTM
- Can be used for background context

<a id="orgb172b57"></a>

## FileName

- Ratnatunga2020<sub>RiseOfNTMLungDisease.pdf</sub>

<a id="org0239e86"></a>

## Abstract

- These lesser known “cousins” of Mycobacterium tuberculosis (TB) were once
  thought to be harmless environmental saprophytics and only dangerous to
  individuals with defective lung structure or the immunosuppressed.

- NTM have become extremely antibiotic resistant, and now have been found to be
  internationally dispersed through person-to-person contact.

<a id="org806a326"></a>

## Conclusion

<a id="orga1797fe"></a>

# WAIT Romero2020 - Decision tree machine learning applied to bovine tuberculosis risk factors to aid disease control decision making

<a id="org5ec8d01"></a>

## Notes

- Can use other algorithms for improving the accuracy i.e. XgBoost

- Uses Decision Tree Classifier to segregate the areas into low, mid, high risk

- Code is not provided

- Ask LJMU staff for help in this

<a id="org5b5f4f8"></a>

## FileName

- Romero2020<sub>DecisionTree.pdf</sub>

<a id="org6b44ddf"></a>

## Abstract

- Identifying and understanding the risk factors for endemic bovine tuberculosis
  (TB) in cattle herds is critical for the control of this disease. Exploratory
  machine learning techniques can uncover complex non-linear relation- ships and
  interactions within disease causation webs, and enhance our knowledge of TB
  risk factors and how they are interrelated.

- The best classification tree models informed multivariable binomial logistic
  regression models in each area, adding statistical inference outputs. These
  two approaches showed similar predictive performance although there were some
  disparities regarding what constituted high-risk predictors.

- Decision tree machine learning approaches can identify risk factors from webs
  of causation: information which may then be used to inform decision making for
  disease control purposes.

<a id="orge69eb5f"></a>

## Conclusion

<a id="org8d0a561"></a>

## Supplementary

<a id="org0304e06"></a>

### Romero2020<sub>DecisionTree</sub><sub>Corrigendum.pdf</sub>

<a id="org835a97c"></a>

# STRT Sauer2018 - Feature selection and prediction of treatment failure in tuberculosis

<a id="orgfb0e836"></a>

## Notes

- Code is available
  <https://github.com/biosharp-dotnet/niaid_TB>

- The data is sourced from dedicated NIH website
  <https://tbportals.niaid.nih.gov/>

- Can use XgBoost and/or H20

- Can add the data from other sources as well
