TopicResearch/Mycobacterium/_Resources.org
** FileName
- Sauer2018_FeatureSelection.pdf
** Abstract
- On a multi-country dataset managed by the National Institute of Allergy and
  Infectious Diseases we applied various machine learning techniques to
  identify factors statistically associated with treatment failure and to
  predict treatment failure based on baseline demographic and clinical
  characteristics alone.
 
** Conclusion 
* [-] Schiff2018 - Clinical relevance of non-tuberculous mycobacteria isolated from respiratory specimens: seven year experience in a UK hospital
** Notes
- Survey report

- Can be used for background context
** FileName
- Schiff2018_ClinicalRelevanceOfNTM.pdf
** Abstract
** Conclusion
* Genome-wide Analysis of MDR and XDR Tuberculosis from Belarus: Machine-learning Approach
** FileName
- Sergeev2016_GenomeWide.pdf
** Notes
** Abstract
** Conclusion
* Vizcaino2010_ComputatationalPrediction.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Waman2019_MycobacterialGenomics.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Wang2020_ADeepLearningBasedMethod.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Weiner2017_HighThroughput.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Wilder2019_ImprovingTuberculosis.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Yang2017_MachineLearning.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Yang2019_DeepAMRForPredicting.pdf
** FileName
** Notes
** Abstract
** Conclusion
* Zhang2020_AnIntegratedMLApproach.pdf
** FileName
** Notes
** Abstract
** Conclusion
