TopicResearch/Mycobacterium/_Resources.md

<a id="orgd2199bb"></a>

## FileName

- Sauer2018<sub>FeatureSelection.pdf</sub>

<a id="org5f929b4"></a>

## Abstract

- On a multi-country dataset managed by the National Institute of Allergy and
  Infectious Diseases we applied various machine learning techniques to
  identify factors statistically associated with treatment failure and to
  predict treatment failure based on baseline demographic and clinical
  characteristics alone.

<a id="org91b1108"></a>

## Conclusion

<a id="org875c2bd"></a>

# [-] Schiff2018 - Clinical relevance of non-tuberculous mycobacteria isolated from respiratory specimens: seven year experience in a UK hospital

<a id="org54256e4"></a>

## Notes

- Survey report

- Can be used for background context

<a id="org513da23"></a>

## FileName

- Schiff2018<sub>ClinicalRelevanceOfNTM.pdf</sub>

<a id="orgd4e3a99"></a>

## Abstract

<a id="orgb96f233"></a>

## Conclusion

<a id="org1105648"></a>

# Genome-wide Analysis of MDR and XDR Tuberculosis from Belarus: Machine-learning Approach

<a id="org156a5fc"></a>

## FileName

- Sergeev2016<sub>GenomeWide.pdf</sub>

<a id="org3a35904"></a>

## Notes

<a id="org021d03f"></a>

## Abstract

<a id="org53797e6"></a>

## Conclusion

<a id="org34e0186"></a>

# Vizcaino2010<sub>ComputatationalPrediction.pdf</sub>

<a id="org976bd3a"></a>

## FileName

<a id="orgdb7d2df"></a>

## Notes

<a id="org1d3732a"></a>

## Abstract

<a id="org75e56d9"></a>

## Conclusion

<a id="org3800a5a"></a>

# Waman2019<sub>MycobacterialGenomics.pdf</sub>

<a id="orgaf5cc41"></a>

## FileName

<a id="org690861b"></a>

## Notes

<a id="org5d80423"></a>

## Abstract

<a id="orgca97a98"></a>

## Conclusion

<a id="orgacde91a"></a>

# Wang2020<sub>ADeepLearningBasedMethod.pdf</sub>

<a id="orgbd17c4b"></a>

## FileName

<a id="org2356d81"></a>

## Notes

<a id="org95ca635"></a>

## Abstract

<a id="orgb22e05f"></a>

## Conclusion

<a id="orgaab12b9"></a>

# Weiner2017<sub>HighThroughput.pdf</sub>

<a id="orgb69ddb6"></a>

## FileName

<a id="org776e57b"></a>

## Notes

<a id="org042cad3"></a>

## Abstract

<a id="orgb1ff1b2"></a>

## Conclusion

<a id="orgc69e8af"></a>

# Wilder2019<sub>ImprovingTuberculosis.pdf</sub>

<a id="org5b5f87b"></a>

## FileName

<a id="orgdc1aef2"></a>

## Notes

<a id="orga35152d"></a>

## Abstract

<a id="org944e6c3"></a>

## Conclusion

<a id="org43f8ceb"></a>

# Yang2017<sub>MachineLearning.pdf</sub>

<a id="orgb79a2a0"></a>

## FileName

<a id="org9be499f"></a>

## Notes

<a id="org869a971"></a>

## Abstract

<a id="org6d2656f"></a>

## Conclusion

<a id="orgf9717df"></a>

# Yang2019<sub>DeepAMRForPredicting.pdf</sub>

<a id="org76bb257"></a>

## FileName

<a id="orgb7cd4a0"></a>

## Notes

<a id="orgf0be83d"></a>

## Abstract

<a id="orgf5e4664"></a>

## Conclusion

<a id="org2fabacc"></a>

# Zhang2020<sub>AnIntegratedMLApproach.pdf</sub>

<a id="org2a21944"></a>

## FileName

<a id="orgf097571"></a>

## Notes

<a id="orgbb9c5bd"></a>

## Abstract

<a id="orgfe550c7"></a>

## Conclusion
